
Лабораторная работа №11
Модульная структура приложения
Задание 1. В соответствии с заданием лабораторной работы №10 разработайте модуль, содержащий функции для обработки структурных типов данных: ввод, вывод и т.п. Выполните задание с использованием разработанного модуля.

Задание 2. В соответствии с заданием лабораторной работы №7 (часть 1), лабораторной работы №8, разработайте модуль, содержащий функции для обработки одномерных массивов: ввод, вывод, сортировку и т.п. Выполните задание с использованием разработанного модуля.

Задание 3. В соответствии с заданием лабораторной работы №7 (часть 2), лабораторной работы №8, разработайте модуль, содержащий функции для обработки двумерных массивов: ввод, вывод и т.п. Выполните задание с использованием разработанного модуля.
